In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['Accenture','Accenture','TCS','TCS','Wipro',"Wipro"],
       'Technology':['Python','Azure','AWS','Kubernets','SQL','Java'],
       'Employees':[497,758,326,658,243,375]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

     Company Technology  Employees
0  Accenture     Python        497
1  Accenture      Azure        758
2        TCS        AWS        326
3        TCS  Kubernets        658
4      Wipro        SQL        243
5      Wipro       Java        375

In [5]:
byComp = df.groupby('Company')

In [6]:
byComp.sum()

           Employees
Company
Accenture       1255
TCS              984
Wipro            618